export default function Main2() {


    return (

        <div
            className="max-w-xs bg-white rounded-lg shadow-md p-4 cursor-pointer transition-all duration-300 hover:max-w-[1000px] hover:whitespace-normal whitespace-nowrap overflow-hidden truncate hover:text-wrap">
            <h3 className="text-xl font-bold text-gray-800">Заголовок</h3>
            <p className="text-gray-600 mt-2">
                Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении Длинный текст, который будет полностью показан при наведении
            </p>
            <div className="mt-3 text-black">
                Дополнительный контент
            </div>
        </div>


    )
}